app/views/jobs/show.html.erb

SELECT "tags".* FROM "tags" INNER JOIN "taggings" ON "tags"."id" = "taggings"."tag_id" WHERE "taggings"."job_id" = ?  [["job_id", 1]]
---
	<strong>Tags:</strong>
	<%= raw @job.tags.map(&:name).map { |t| link_to t, tag_path(t) }.join(', ') %>